import type { Role } from "../../types/roles.types";

const RoleDetails: Role[] = [
  {
    id: 1,
    charachterIndex: 9,
    name: "پدرخوانده",
    side: "MAFIA",
    min: 1,
    max: 1,
    description: "رهبر مافیا، انتخاب قربانی هر شب",
    longDescription:
      "پدرخوانده رئیس مافیاست و در هر شب می‌تواند دستور قتل یک نفر را صادر کند. معمولاً در تحقیقات کارآگاه بی‌گناه به نظر می‌رسد، پس پیدا کردن او سخت‌تر است.",
    settings: { shields: { caption: "تعداد سپر", default: 0, min: 0, max: 2 } },
  },
  {
    id: 2,
    name: "مافیا ساده",
    charachterIndex: 10,
    side: "MAFIA",
    min: 0,
    max: Infinity,
    description: "همکاری با مافیا برای کشتن شهروندان",
    longDescription:
      "مافیا ساده در شب همراه با سایر اعضای مافیا تصمیم می‌گیرد که چه کسی حذف شود. این نقش توانایی ویژه‌ای ندارد اما در بحث روز باید خود را شهروند جا بزند و شهر را گمراه کند.",
  },
  {
    id: 3,
    name: "دکتر لکتر",
    charachterIndex: 11,
    side: "MAFIA",
    min: 0,
    max: 1,
    description: "درمان و نجات اعضای مافیا",
    longDescription:
      "دکتر لکتر می‌تواند هر شب یکی از اعضای مافیا (حتی خودش) را از کشته شدن نجات دهد. او باید با هماهنگی با پدرخوانده و سایر اعضا بهترین هدف برای محافظت را انتخاب کند.",
  },
  {
    id: 4,
    name: "مذاکره کننده",
    charachterIndex: 13,
    side: "MAFIA",
    min: 0,
    max: 1,
    description: "فریب و گمراه‌کردن شهروندان در بحث‌ها",
    longDescription:
      "مذاکره‌کننده با توانایی اقناع و دروغ‌پردازی تلاش می‌کند شهروندان را فریب دهد. او در بحث‌ها نقش مهمی در منحرف کردن شک‌ها و نجات هم‌تیمی‌های مافیا دارد.",
  },
  {
    id: 5,
    name: "ناتاشا",
    charachterIndex: 14,
    side: "MAFIA",
    min: 0,
    max: 1,
    description: "ساکت کردن یک بازیکن برای یک روز",
    longDescription:
      "ناتاشا هر شب می‌تواند یک نفر را انتخاب کند تا در روز بعد نتواند صحبت یا دفاع کند. این توانایی می‌تواند بازیکنان کلیدی شهر را از روند بحث خارج کرده و به مافیا برتری بدهد.",
  },
  {
    id: 6,
    name: "شهروند ساده",
    charachterIndex: 0,
    side: "TOWN",
    min: 0,
    max: Infinity,
    description: "بدون قدرت شبانه، فقط بحث و رای‌گیری",
    longDescription:
      "شهروند ساده فقط در روز می‌تواند با بحث و رای‌گیری به شناسایی و حذف مافیا کمک کند. این نقش هیچ قابلیت ویژه‌ای در شب ندارد و باید با استدلال و همکاری با سایر شهروندان از کشته‌شدن خود جلوگیری کند.",
  },
  {
    id: 7,
    charachterIndex: 1,
    name: "دکتر",
    side: "TOWN",
    min: 0,
    max: 1,
    description: "نجات یک نفر از مرگ در شب",
    longDescription:
      "دکتر هر شب می‌تواند یک نفر (حتی خودش) را انتخاب و از کشته شدن محافظت کند. انتخاب درست دکتر می‌تواند نتیجه بازی را تغییر دهد. او باید با دقت انتخاب کند تا مورد هدف مافیا قرار نگیرد.",
    settings: {
      selfSaveCount: {
        caption: "تعداد نجات خود در بازی",
        default: 1,
        max: 5,
        min: 0,
      },
    },
  },

  {
    id: 8,
    name: "کارآگاه",
    charachterIndex: 2,
    side: "TOWN",
    min: 0,
    max: 1,
    description: "شناسایی مافیا با تحقیق شبانه",
    longDescription:
      "کارآگاه هر شب می‌تواند یک نفر را بررسی کند و بفهمد که آیا او مافیاست یا خیر. کارآگاه باید نتایج خود را هوشمندانه استفاده کند تا بدون لو رفتن، شهر را به سمت پیروزی هدایت کند.",
  },
  {
    id: 9,
    name: "تک تیرانداز",
    charachterIndex: 3,
    side: "TOWN",
    min: 0,
    max: 1,
    description: "یک شلیک مرگبار در کل بازی",
    longDescription:
      "تک تیرانداز تنها یک بار در طول بازی می‌تواند به یک نفر شلیک کند و او را حذف کند. این شلیک حتی اگر هدف شهروند باشد باعث مرگ او می‌شود، پس باید با دقت و زمان‌بندی درست استفاده شود.",
  },

  {
    id: 10,
    name: "جان سخت",
    charachterIndex: 8,
    side: "TOWN",
    min: 0,
    max: 1,
    description: "یک جان اضافه برای بقا بیشتر",
    longDescription:
      "جان‌سخت اگر در شب یا روز هدف قرار بگیرد، یک بار از مرگ نجات پیدا می‌کند و در دور بعد همچنان در بازی باقی می‌ماند. این ویژگی او را به یکی از مقاوم‌ترین نقش‌ها تبدیل می‌کند.",
  },
];

export default RoleDetails;
