const RolesList = [
    {
        id:1,
        name:"شهروند ساده",
        side:"شهر",
        desc:"بدون قابلیت خاص"
    },
    {
        id:2,
        name:"مافیا ساده",
        side:"مافیا",
        desc:"بدون قابلیت خاص"
    },
    {
        id:3,
        name:"دکتر",
        side:"شهر",
        desc:"قابلیت نجات دادن جان شهروندان از جمله خودش"
    },
    {
        id:4,
        name:"پدر خوانده",
        side:"مافیا",
        desc:"قابلیت حذف یک شهروند در هر شب"
    },
    {
        id:5,
        name:"کاراگاه",
        side:"شهر",
        desc:"قابلیت شناسایی اعضای مافیا"
    },
    {
        id:6,
        name:"تک تیر انداز",
        side:"شهر",
        desc:"قابلیت فقط یکبار تیراندازی کردن"
    },
    {
        id:7,
        name:"مذاکره کننده",
        side:"مافیا",
        desc:"قابلیت فریب اعضای شهر"
    },
    {
        id:8,
        name:"جان سخت",
        side:"شهر",
        desc:"یک جان اضافه تر دارد"
    },
    {
        id:9,
        name:"دکتر لکتر",
        side:"مافیا",
        desc:"قابلیت نجات دادن اعضای مافیا حتی خودش"
    },
    {
        id:10,
        name:"ناتاشا",
        side:"مافیا",
        desc:"میتواند هر بار برای یک روز یک نفر را سایلنت کند"
    },
]
export default RolesList